{
	"name": "Bigby's Hand",
	"level":
	{
		"Controlled": "Level5"
	},
	"school":
	{
		"Controlled": "Evocation"
	},
	"is_ritual": false,
	"casting_time":
	{
		"Controlled":
		{
			"Actions": 1
		}
	},
	"range":
	{
		"Controlled":
		{
			"Dist":
			{
				"Feet": 120
			}
		}
	},
	"has_v_component": true,
	"has_s_component": true,
	"m_components": "an eggshell and a glove",
	"duration":
	{
		"Controlled":
		{
			"Minutes": [1, true]
		}
	},
	"description": "You create a Large hand of shimmering magical energy in an unoccupied space that you can see within range. The hand lasts for the duration, and it moves at your command, mimicking the movements of your own hand.\nThe hand is an object that has AC 20 and Hit Points equal to your Hit Point maximum. If it drops to 0 Hit Points, the spell ends. The hand doesn't occupy its space.\nWhen you cast the spell and as a Bonus Action on your later turns, you can move the hand up to 60 feet and then cause one of the following effects:\n\n<b> Clenched Fist. <r> The hand strikes a target within 5 feet of it. Make a melee spell attack. On a hit, the target takes 5d8 Force damage.\n<b> Forceful Hand. <r> The hand attempts to push a Huge or smaller creature within 5 feet of it. The target must succeed on a Strength saving throw, or the hand pushes the target up to 5 feet plus a number of feet equal to five times your spellcasting ability modifier. The hand moves with the target, remaining within 5 feet of it.\n<b> Grasping Hand. <r> The hand attempts to grapple a Huge or smaller creature within 5 feet of it. The target must succeed on a Dexterity saving throw, or the target has the Grappled condition, with an escape DC equal to your spell save DC. While the hand grapples the target, you can take a Bonus Action to cause the hand to crush it, dealing Bludgeoning damage to the target equal to 4d6 plus your spellcasting ability modifier.\n<b> Interposing Hand. <r> The hand grants you Half Cover against attacks and other effects that originate from its space or that pass through it. In addition, its space counts as Difficult Terrain for your enemies.\n",
	"upcast_description": "The damage of the Clenched Fist increases by 2d8 and the damage of the Grasping Hand increases by 2d6 for each spell slot level above 5.",
	"tables": []
}